#### 📖 Terraform Plan ('infra/resources/prod/italynorth') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.cosmos.azurerm_monitor_metric_alert.cosmos_wallet_throttling_alert will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_wallet_throttling_alert" {
      + auto_mitigate            = false
      + description              = "One or more collections consumed throughput (RU/s) exceed provisioned throughput. Please, consider to increase RU for these collections. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/723452380/CosmosDB+-+Increase+Max+RU"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[WALLET | io-p-itn-cosmos-wallet] Throttling"
      + resource_group_name      = "io-p-itn-rg-wallet"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "North Italy",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.functions.azurerm_app_service_plan.app_service_plan_wallet_common will be created
  + resource "azurerm_app_service_plan" "app_service_plan_wallet_common" {
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "io-p-itn-plan-wallet-common"
      + reserved                     = true
      + resource_group_name          = "io-p-itn-rg-wallet"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }

      + sku {
          + capacity = 1
          + size     = "P1v3"
          + tier     = "PremiumV3"
        }
    }

  # module.resource_groups.azurerm_resource_group.resource_group_wallet will be created
  + resource "azurerm_resource_group" "resource_group_wallet" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-rg-wallet"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
    }

  # module.cosmos.module.cosmos_account_wallet.azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = true
      + enable_free_tier                             = false
      + enable_multiple_write_locations              = false
      + endpoint                                     = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = true
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "italynorth"
      + mongo_server_version                         = (known after apply)
      + name                                         = "io-p-itn-cosmos-wallet"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = false
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "io-p-itn-rg-wallet"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
      + write_endpoints                              = (known after apply)

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + type                = "Continuous"
        }

      + consistency_policy {
          + consistency_level = "Strong"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "germanywestcentral"
          + zone_redundant    = true
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.cosmos.module.cosmos_account_wallet.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[WALLET | io-p-itn-cosmos-wallet] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-rg-wallet"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "italynorth",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.cosmos.module.cosmos_account_wallet.azurerm_private_endpoint.sql[0] will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cosmos-wallet-sql-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-rg-wallet"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cosmos-wallet-sql-endpoint"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "Sql",
            ]
        }
    }

  # module.cosmos.module.cosmos_database_wallet.azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "io-p-itn-cosmos-wallet"
      + id                  = (known after apply)
      + name                = "db"
      + resource_group_name = "io-p-itn-rg-wallet"
      + throughput          = (known after apply)
    }

  # module.cosmos.module.wallet_cosmosdb_containers["wallet-instance-records"].azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-cosmos-wallet"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "wallet-instance-records"
      + partition_key_path  = "/id_holder"
      + resource_group_name = "io-p-itn-rg-wallet"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 2000
        }
    }

  # module.functions.module.function_wallet.azurerm_private_endpoint.blob[0] will be created
  + resource "azurerm_private_endpoint" "blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "iopitnwalletfn001sdt-blob-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-rg-wallet"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "iopitnwalletfn001sdt-blob"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.functions.module.function_wallet.azurerm_private_endpoint.queue[0] will be created
  + resource "azurerm_private_endpoint" "queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "iopitnwalletfn001sdt-queue-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-rg-wallet"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = []
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "iopitnwalletfn001sdt-queue"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.functions.module.function_wallet.azurerm_private_endpoint.table[0] will be created
  + resource "azurerm_private_endpoint" "table" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "iopitnwalletfn001sdt-table-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-rg-wallet"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/eudi-wallet-it-wallet-solution/blob/main/infra/resources/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = []
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "iopitnwalletfn001sdt-table"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.functions.module.function_wallet.module.storage_account.azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_wallet.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8
```

</details>
